In [42]:
date ='23/10/2023'
n_sick =32
calls= 56
n_duty =87
dafted=0
data={'date':pd.to_datetime(date),'n_sick':n_sick , 'calls':calls ,'n_duty':n_duty, 'dafted':dafted}

df = pd.DataFrame(data,index=['date'])
df = df.set_index('date')
df

C:\Users\Rafay\AppData\Local\Temp\ipykernel_15984\2236575555.py:6: UserWarning: Parsing '23/10/2023' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  data={'date':pd.to_datetime(date),'n_sick':n_sick , 'calls':calls ,'n_duty':n_duty, 'dafted':dafted}

            n_sick  calls  n_duty  dafted
date
2023-10-23      32     56      87       0

In [33]:
df = pd.DataFrame(
    {
        "group": ["A", "A", "A", "A", "A"],
        "date": pd.to_datetime(["2020-01-02", "2020-01-13", "2020-02-01", "2020-02-23", "2020-03-05"]),
        "value": [10, 20, 16, 31, 56],
    }
)
df

  group       date  value
0     A 2020-01-02     10
1     A 2020-01-13     20
2     A 2020-02-01     16
3     A 2020-02-23     31
4     A 2020-03-05     56

In [18]:
import pandas as pd

data=[['Karan',23],['Rohit',22],['Sahil',21],['Aryan',24]]

df= pd.DataFrame(data,columns=['Name','Age'])

df

    Name  Age
0  Karan   23
1  Rohit   22
2  Sahil   21
3  Aryan   24